<template>
  <CardContainer>
    <div>
      <div class="container" style="padding: 30px 50px 0 50px">
        <div class="row align-items-center">
          <div class="col-md-7 mb-md-0 mb-4">
            <h3 class="text-gradient text-primary mb-0 mt-2">"전도는 교회의 본질입니다."</h3>
            <p style="line-height: 40px; padding: 0 10px">
              교회를 교회되게 했던 것은 바로 전도입니다.<br />
              교회는 전도를 할 때 교회로서의 가치가 있는 것입니다.<br />
              왜냐하면 예수님께서 교회를 향하여 전도를 명하셨기 때문입니다.
            </p>
            <h3 class="text-gradient text-primary mb-0 mt-2">"전도는 교회의 사명입니다."</h3>
            <p style="line-height: 40px; padding: 0 10px">
              전도는 교회에 맡겨진 사명입니다. 교회는 사명을 감당하여야 합니다. 전도를 통하여 세상에
              하나님의 뜻이 이루어진 하나님의 나라가 건설될 수 있도록 하여야 합니다. 이 땅에 예수의
              생명의 역사가 이루어진 예수의 나라를 확장하여야 합니다. 그것이 바로 교회의 사명입니다.
              예수님께서는 전도를 위하여 제자를 부르셨으며 교회를 세우셨습니다. 전도는 예수님의 삶의
              모습이었고 주님의 마지막 명령이며 교회의 최대의 사명입니다. 최우선적으로 관심을 가져야
              할 것입니다. 전도는 초대교회의 유일한 관심이었습니다.
            </p>
          </div>
          <div class="col-md-5">
            <div class="card p-0 rounded-3">
              <div class="blur-shadow-image" style="text-align: center">
                <img
                  src="https://raw.githubusercontent.com/creativetimofficial/public-assets/master/soft-ui-design-system/assets/img/buildings.jpg"
                  alt="img-blur-shadow"
                  class="img-fluid shadow rounded-3"
                />
              </div>
              <div
                class="colored-shadow"
                style="
                  background-image: url('https://raw.githubusercontent.com/creativetimofficial/public-assets/master/soft-ui-design-system/assets/img/buildings.jpg');
                "
              ></div>
            </div>
          </div>
        </div>
      </div>
      <!-- -------- START Features w/ icons and text on left & gradient title and text on right -------- -->
      <div class="card-body p-5">
        <h3 class="text-gradient text-primary mb-0 mt-2">1. 전도란 무엇인가?</h3>
        <p>전도란 무엇입니까? 전도를 통하여 어떠한 일이 이루어집니까? 왜 전도를 하여야 합니까?</p>
        <ul>
          <li>전도를 통하여 교회가 부흥되기 때문입니다.</li>
          <p>
            그리스도의 몸된 교회가 성장하기 때문입니다. 전도는 아직도 믿지 않지만 믿어야 할 사람을
            믿게 만드는 것입니다. 교회 밖에 있는 사람을 교회 안으로 인도하는 것입니다. 밖에 있던
            불신자를 안에 있는 신자로 만드는 것입니다. 그 일을 통하여 그들의 소속을 그리스도에게로
            이끄는 것입니다. 전도를 통하여 교회는 커갑니다. 교회는 큰 교회 작은 교회가 없습니다. 커
            가는 교회와 작아지는 교회가 있습니다. 지금은 작지만 커갈 수 있고 아예 사라질 수도
            있습니다. 지금 큰 교회가 더욱 클 수도 있고 점차 작아질 수 있습니다. 하나님께서는
            우리들의 교회가 점점 커가기를 원하십니다.
          </p>
          <li>전도는 단순히 사람을 교회의 소속으로 만드는 것이 아닙니다.</li>
          <p>
            사람을 변화시키는 일입니다. 사람을 바꾸는 일입니다. 세상에 속하였던 사람을 하나님의
            사람으로 만드는 것입니다. 세상을 의지하던 사람을 예수님을 의지하는 사람으로 바꾸는
            것입니다. 세상의 욕심을 좇던 옛사람을 새사람으로 바꾸는 것입니다. 교회가 부흥되는 것만이
            아니라 한 사람의 삶 속에서 하나님의 형상이 회복되고 그리스도의 향기가 나타나게 됩니다.
            전도는 예수를 믿는 그 사람에게 복이 되는 것입니다. 영원한 생명을 얻게 되는 것입니다.
          </p>
          <li>한 사람의 변화로 끝나지 않습니다.</li>
          <p>
            하나님께서는 사람을 택하시고 부르실 때에 한 사람의 구원으로 끝내시지 않습니다. 가문이
            변화됩니다. 하나님이 아브라함을 부르심으로 이삭과 야곱과 요셉의 가문이 생겼습니다. 우리
            주변에는 예수를 믿음으로 인하여 세월이 가고 믿음의 가문이 세워지는 것을 볼 수 있습니다.
            가정에 예수의 복음이 들어가면 가문이 바뀝니다. 민족에 예수의 복음이 들어가면 민족의
            운명이 바뀝니다.
          </p>
          <li>우리가 전도를 하여야 할 이유는 분명합니다.</li>
          <p>
            우리의 삶의 본이 되시는 그리스도를 본받아야 하기 때문입니다. 예수님의 오신 목적은
            분명합니다. "인자의 온 것은 잃어버린 자를 찾아 구원하려 함이니라"고 하셨습니다.
            예수님께서는 자신의 사역에서 전도의 모범을 보이셨습니다. 예수님의 명령이므로 전도를
            하여야 합니다. 예수님은 온 세상에 복음을 전하라고 명하셨습니다. 제자들을 처음부터 목적을
            가지고 부르셨습니다. "사람을 낚는 어부가 되게 하리라"고 하셨습니다. 제자들에게 "모든
            족속으로 제자를 삼으라"고 하셨습니다. 제자란 그리스도를 본 받는 성숙된 성도들입니다.
            전도의 명령은 우리에게 주신 명령입니다
          </p>
        </ul>
        <h3 class="text-gradient text-primary mb-0 mt-2">2. 전도는 누가 하는가?</h3>
        <ul>
          <li>전도는 하나님이 친히 하십니다.</li>
          <p>
            열매를 거두게 하시는 분은 하나님이십니다. 우리가 나가서 전하기는 하지만 열매를 맺게
            하시는 분, 일을 이루시는 분은 하나님이심을 알게 됩니다.
          </p>
          <li>하나님께서 행하시는 전도를 우리에게 맡기셨습니다.</li>
          <p>
            우리는 일군으로 부름을 받았습니다. 우리는 하나님의 부르심에 응답하여야 합니다. 일군에게
            맡겨주신 것은 오직 충성뿐입니다. 하나님께서는 충성하는 자에게 상급을 주십니다.
            충성스럽게 전도하는 교회에 부흥을 주십니다. 명령에 순종하는 자에게 상을 주시는
            분이십니다. 우리는 우리에게 맡기신 일본복음화, 세계복음화의 사명을 감당하여야 합니다.
          </p>
          <li>전도에는 실패가 없습니다.</li>
          <p>
            우리는 결실을 하여야 성공이라고 생각합니다. 전도를 하였는데 결실하지 못하면 실패라고
            생각합니다. 그것은 참으로 어리석은 생각입니다. 농사를 생각해 보십시오. 추수를 위하여
            농사를 짓습니다. 추수를 하여야 성공입니다. 그렇다고 농부가 밭에 나가서 며칠간 밭을 갈고
            돌아올 때 추수를 하지 못하였다고 실패라고 생각하지 않습니다. 농부가 씨를 뿌리러 나가서
            씨를 뿌리고 돌아올 때 단을 가지고 오지 않았다해도 실패했다고 생각하지 않습니다. 밭 갈고
            씨 뿌리는 것 자체를 성공으로 생각하기 때문입니다. 김 매고 비료를 주는 것 자체가
            성공입니다. 언젠가 열매를 거둘 때가 옵니다. 그것은 이미 많은 수고가 있었기 때문에 가능한
            것입니다.
          </p>
        </ul>

        <h3 class="text-gradient text-primary mb-0 mt-2">3. 어떻게 전하여야 하는가?</h3>
        <ul>
          <li>전도를 하려면 무엇보다도 먼저 눈이 바뀌어야 합니다.</li>
          <p>
            눈이 바뀐다고 하는 것은 관심이 바뀌는 것입니다. 사람에게는 관심에 따라서 보이는 것이
            다릅니다. 전도하려는 마음을 가지면 사방에 전도할 사람이 보입니다. 영혼 구원에 관심이
            있으면 모든 사람이 구원을 받아야 할 사람으로 보입니다. 아직도 나에게 전도 대상자가 안
            보인다면 그것은 아직 나에게 주님이 가지신 구령의 열정, 영혼에 대한 관심이 없다는
            증거입니다. 지금 당신의 눈에는 무엇이 보입니까? 그것은 당신의 관심사입니다. 하나님께
            기도 드리어야 합니다. 나의 눈이 열리게 해달라고 기도하여야 합니다.
          </p>
          <li>전도를 하려면 미련해야 합니다.</li>
          <p>
            미련스러울 정도로 열심을 내야 합니다. 하나님께서는 미련한 자를 들어서 지혜로운 자를
            부끄럽게 하십니다. 농사는 지혜를 가지고 하는 것이 아닙니다. 땀으로 하는 것입니다. 전도를
            하면 쉽게 받아들이지 않습니다. 천하보다 귀한 한 생명을 건지는 일이 그렇게 쉬운 일이
            아니기 때문입니다. 그러나 인내를 가지고 나아가야 합니다. 전도자에게 요구되는 것 가운데
            하나는 낙심하지 아니하는 자세입니다. 사람이 보기에 미련할 정도로 힘을 다하여 전할 때에
            열매를 맺게 하십니다.
          </p>
          <li>전도를 하려면 권세를 가지고 나아가야 합니다.</li>
          <p>
            성령이 함께 하심을 믿어야 합니다. 그래야 담대하게 전도를 할 수 있습니다. 전도의 현장에는
            우리만 가는 것이 아닙니다. 성령께서 함께 하십니다. 성령이 함께 하시면 우리에게 권세가
            임합니다. 우리는 권세를 가지고 나아가야 합니다. 영적인 전쟁이니 영적인 권세가
            필요합니다. 상대방을 사로잡고 있는 권세를 이겨야 합니다. 겁 먹지 말아야 합니다. 담대하게
            나아가야 합니다. 권세를 가지고 나아가면 악한 것들이 도망가는 것을 보게 될 것입니다. 내가
            아니라 성령이 승리하는 것을 보게 됩니다.
          </p>
          <li>전도를 하려면 생각이 바뀌어야 합니다.</li>
          <p>
            전도의 결실을 맺으려면 전도하고 싶은 마음이 먼저 생겨야 합니다. 예수님께서 가지셨던
            소원, 바울이 가졌던 소원. 이 땅에 하나님의 나라가 건설되기를 원하는 전도의 소원을 가져야
            합니다. 그러면 전도가 가능합니다. 원하는 소원만으로 되는 것이 아닙니다. 할 수 있다는
            생각을 가져야 합니다. 많은 사람들이 자신이 재능을 가지고 있으면서도 두려움과 염려,
            소극적인 생각으로 인하여 시도도 하지 않습니다. 자신이 할 수 있을 것이라는 생각을 하지
            않습니다. 자신은 할 수 없다고 생각합니다. 사도들은 능력을 주시는 자 안에서 무엇이든지 할
            수 있다고 믿었습니다. 자신들의 힘으로는 할 수 없으나 함께 하시며 도우시는 성령의
            능력으로 할 수 있다고 생각하였습니다. 확신을 가졌습니다. 그러한 확신이 그들을 움직이게
            만들었습니다. 움직일 때 성령이 도우셨고 할 수 있게 하였습니다. 우리에게 무엇보다도
            필요한 것은 할 수 있다는 마음입니다.
          </p>
        </ul>
      </div>
    </div>
  </CardContainer>
</template>

<script setup>
import CardContainer from '@/components/common/card/CardContainer.vue'
import { useStore } from 'vuex'
import { TESTIMONY } from '@/data/sidemenu.js'

const store = useStore()
store.dispatch('FETCH_SIDEMENU', TESTIMONY)
</script>

<style lang="scss" scoped></style>
