export const WITH_DIARY_TEMPLATE_KO = [
  '<p>1. 아침에 일어났을 때 예수님을 생각했습니까? (예)</p>',
  '<p>2. 식사할 때 (아침, 점심, 저녁) 예수님을 생각했습니까? (예)</p>',
  '<p>3. 일을 시작하기 전에 예수님을 생각하며 기도했습니까? (예)</p>',
  '<p>4. 오늘 말씀을 묵상했습니까? (예)</p>',
  '<p>5. 하루 중에 묵상한 말씀이 생각나거나 말씀에 순종한 적이 있습니까? (예)</p>',
  '<p>6. 예수님께 “어떻게 해야 할까요?” 하고 물어본 적이 있습니까? (예)</p>',
  '<p>7. 예수님의 이름을 불러본 적이 있습니까? (예)</p>',
  '<p>8. 사람을 만날 때나 일할 때 예수님을 생각했습니까? (예)</p>',
  '<p>9. 집에 있을 때나 이동할 때 예수님을 생각했습니까? (예)</p>',
  '<p>10. 예수님이 싫어하실 행동을 한 적이 있습니까? (예)</p>',
  '<p>11. 예수님이 기뻐하실 행동을 한 적이 있습니까? (예)</p>',
  '<p>12. 오늘 당신의 삶은 주님이 얼마나 기뻐하실까요?(%)</p>',
  '<p>13. 오늘 주님이 주시는 메시지는 무엇이었습니까? 예수님께서 하라고 지시하시는 것 같아 순종한 것은 무엇입니까?</p>',
  '<p>14. 위의 경우 외에 하루 중 예수님을 생각한 것은 언제입니까? (3가지 이상 쓰기)</p>',
  '<p>15. 오늘 예수님을 바라보는데, 가장 큰 장애물은 무엇이라고 생각합니까?</p>',
  '<p>16. 오늘 하나님이 주신 은혜에 대해서 3가지 이상 하나님께 감사합시다. (10가지 이하)</p>'
].join('')

export const WITH_DIARY_TEMPLATE_JA = [
  '<p>1. 朝起きたとき、イエス様のことを思いましたか。はい</p>',
  '<p>2. 食事のとき（朝・昼・夕）、イエス様のことを思いましたか。はい</p>',
  '<p>3. 仕事を始める前に、イエス様を思いながら祈りましたか。はい</p>',
  '<p>4. 今日、御言葉を黙想しましたか。はい</p>',
  '<p>5. 一日の中で、黙想した御言葉を思い出したり、その御言葉に従ったことはありましたか。はい</p>',
  '<p>6. イエス様に「どうすればよいでしょうか」と尋ねたことはありましたか。はい</p>',
  '<p>7. イエス様のお名前を呼んだことはありましたか。はい</p>',
  '<p>8. 人と会うときや働くとき、イエス様のことを思いましたか。はい</p>',
  '<p>9. 家にいるときや移動中に、イエス様のことを思いましたか。はい</p>',
  '<p>10. イエス様が嫌われる行動をしてしまったことはありましたか。はい</p>',
  '<p>11. イエス様が喜ばれる行動をしたことはありましたか。はい</p>',
  '<p>12. 今日のあなたの生活は、主がどのくらい喜ばれると思いますか。％</p>',
  '<p>13. 今日、主があなたに与えてくださったメッセージは何でしたか。また、イエス様が「これをしなさい」と示されているように感じ、従ったことは何ですか。</p>',
  '<p>14. 上記以外で、一日の中にイエス様のことを思ったのはいつでしたか。3つ以上書きなさい。</p>',
  '<p>15. 今日、イエス様を見つめるうえで、最も大きな妨げは何だと思いますか。</p>',
  '<p>16. 今日、神様から与えられた恵みについて、3つ以上神様に感謝しましょう。(10個以内)</p>'
].join('')
